{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["input_2", 0, 0]]], "name": "block1_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block1_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block2_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block3_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block4_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "block5_conv3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3"}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten"}, "inbound_nodes": [[["block5_pool", 0, 0]]], "name": "flatten"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 25088, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 4096}, "inbound_nodes": [[["flatten", 0, 0]]], "name": "fc1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "fc2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4096, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 4096}, "inbound_nodes": [[["fc1", 0, 0]]], "name": "fc2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "predictions", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 4096, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 1000}, "inbound_nodes": [[["fc2", 0, 0]]], "name": "predictions"}], "input_layers": [["input_2", 0, 0]], "output_layers": [["predictions", 0, 0]], "name": "model_2"}}
